IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_mdl_xbar_regs.xml
<module id="MDL_XBAR_REGS" HW_revision="" description="MDL XBAR Registers">
	<register id="MDL1SELECT" width="16" page="1" offset="0x0" internal="0" description="MDL1SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL1 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL2SELECT" width="16" page="1" offset="0x1" internal="0" description="MDL2SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL2 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL3SELECT" width="16" page="1" offset="0x2" internal="0" description="MDL3SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL3 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL4SELECT" width="16" page="1" offset="0x3" internal="0" description="MDL4SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL4 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL5SELECT" width="16" page="1" offset="0x4" internal="0" description="MDL5SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL5 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL6SELECT" width="16" page="1" offset="0x5" internal="0" description="MDL6SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL6 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL7SELECT" width="16" page="1" offset="0x6" internal="0" description="MDL7SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL7 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL8SELECT" width="16" page="1" offset="0x7" internal="0" description="MDL8SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL8 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL9SELECT" width="16" page="1" offset="0x8" internal="0" description="MDL9SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL9 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL10SELECT" width="16" page="1" offset="0x9" internal="0" description="MDL10SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL10 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL11SELECT" width="16" page="1" offset="0xa" internal="0" description="MDL11SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL11 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL12SELECT" width="16" page="1" offset="0xb" internal="0" description="MDL12SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL12 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL13SELECT" width="16" page="1" offset="0xc" internal="0" description="MDL13SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL13 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL14SELECT" width="16" page="1" offset="0xd" internal="0" description="MDL14SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL14 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL15SELECT" width="16" page="1" offset="0xe" internal="0" description="MDL15SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL15 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="MDL16SELECT" width="16" page="1" offset="0xf" internal="0" description="MDL16SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for MDL16 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="INPUTSELECTLOCK" width="32" page="1" offset="0x1e" internal="0" description="Input Select Lock Register">
		<bitfield id="MDL1SELECT" description="Lock bit for MDL1SELECT Register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MDL2SELECT" description="Lock bit for MDL2SELECT Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MDL3SELECT" description="Lock bit for MDL3SELECT Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MDL4SELECT" description="Lock bit for MDL4SELECT Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MDL5SELECT" description="Lock bit for MDL5SELECT Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MDL6SELECT" description="Lock bit for MDL6SELECT Register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MDL7SELECT" description="Lock bit for MDL7SELECT Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MDL8SELECT" description="Lock bit for MDL8SELECT Register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MDL9SELECT" description="Lock bit for MDL9SELECT Register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MDL10SELECT" description="Lock bit for MDL10SELECT Register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MDL11SELECT" description="Lock bit for MDL11SELECT Register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MDL12SELECT" description="Lock bit for MDL12SELECT Register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MDL13SELECT" description="Lock bit for MDL13SELECT Register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MDL14SELECT" description="Lock bit for MDL14SELECT Register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MDL15SELECT" description="Lock bit for MDL15SELECT Register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MDL16SELECT" description="Lock bit for MDL16SELECT Register" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
